FIOLOG/nvme0n1_220530_100947_fio.log
/dev/nvme0n1: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=3816: Mon May 30 10:09:57 2022
  write: IOPS=24.7k, BW=3086MiB/s (3236MB/s)(30.1GiB/10002msec); 0 zone resets
    slat (usec): min=6, max=155, avg=14.65, stdev= 6.02
    clat (usec): min=381, max=6328, avg=1280.62, stdev=325.89
     lat (usec): min=402, max=6338, avg=1295.35, stdev=325.84
    clat percentiles (usec):
     |  1.00th=[ 1221],  5.00th=[ 1221], 10.00th=[ 1237], 20.00th=[ 1237],
     | 30.00th=[ 1254], 40.00th=[ 1254], 50.00th=[ 1254], 60.00th=[ 1254],
     | 70.00th=[ 1254], 80.00th=[ 1270], 90.00th=[ 1270], 95.00th=[ 1270],
     | 99.00th=[ 1303], 99.50th=[ 4752], 99.90th=[ 4817], 99.95th=[ 6259],
     | 99.99th=[ 6325]
   bw (  MiB/s): min= 3063, max= 3093, per=100.00%, avg=3088.13, stdev= 8.81, samples=19
   iops        : min=24504, max=24750, avg=24705.05, stdev=70.50, samples=19
  lat (usec)   : 500=0.01%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=99.16%, 4=0.03%, 10=0.78%
  cpu          : usr=23.00%, sys=24.63%, ctx=246471, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,246940,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=3086MiB/s (3236MB/s), 3086MiB/s-3086MiB/s (3236MB/s-3236MB/s), io=30.1GiB (32.4GB), run=10002-10002msec

Disk stats (read/write):
  nvme0n1: ios=51/244276, merge=0/0, ticks=10/313441, in_queue=313450, util=99.15%