FIOLOG/nvme0n1_220601_161134_fio.log
/dev/nvme0n1: (g=0): rw=randwrite, bs=(R) 512B-64.0KiB, (W) 512B-64.0KiB, (T) 512B-64.0KiB, ioengine=libaio, iodepth=16
...
fio-3.28
Starting 2 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=121266: Wed Jun  1 16:11:45 2022
  write: IOPS=24.7k, BW=185MiB/s (194MB/s)(1848MiB/10005msec); 0 zone resets
    slat (usec): min=2, max=128, avg= 7.51, stdev= 5.77
    clat (usec): min=76, max=30161, avg=637.45, stdev=2051.31
     lat (usec): min=81, max=30174, avg=645.12, stdev=2051.86
    clat percentiles (usec):
     |  1.00th=[  182],  5.00th=[  217], 10.00th=[  237], 20.00th=[  265],
     | 30.00th=[  289], 40.00th=[  318], 50.00th=[  355], 60.00th=[  392],
     | 70.00th=[  437], 80.00th=[  498], 90.00th=[  750], 95.00th=[ 1012],
     | 99.00th=[17957], 99.50th=[20055], 99.90th=[22152], 99.95th=[22938],
     | 99.99th=[25560]
   bw (  KiB/s): min=93318, max=354869, per=51.24%, avg=193880.95, stdev=109526.03, samples=19
   iops        : min=12008, max=46320, avg=25391.32, stdev=14435.00, samples=19
  lat (usec)   : 100=0.01%, 250=14.33%, 500=65.70%, 750=10.05%, 1000=4.79%
  lat (msec)   : 2=3.63%, 4=0.41%, 10=0.02%, 20=0.56%, 50=0.51%
  cpu          : usr=12.83%, sys=19.93%, ctx=108197, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,247583,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=121267: Wed Jun  1 16:11:45 2022
  write: IOPS=24.7k, BW=185MiB/s (194MB/s)(1849MiB/10005msec); 0 zone resets
    slat (usec): min=2, max=126, avg= 7.54, stdev= 5.84
    clat (usec): min=51, max=30134, avg=638.16, stdev=2052.92
     lat (usec): min=57, max=30142, avg=645.86, stdev=2053.50
    clat percentiles (usec):
     |  1.00th=[  184],  5.00th=[  217], 10.00th=[  237], 20.00th=[  265],
     | 30.00th=[  289], 40.00th=[  318], 50.00th=[  355], 60.00th=[  392],
     | 70.00th=[  437], 80.00th=[  502], 90.00th=[  750], 95.00th=[ 1012],
     | 99.00th=[17957], 99.50th=[20055], 99.90th=[22152], 99.95th=[22938],
     | 99.99th=[25560]
   bw (  KiB/s): min=88654, max=363521, per=51.37%, avg=194396.53, stdev=111402.89, samples=19
   iops        : min=11952, max=46534, avg=25367.11, stdev=14491.10, samples=19
  lat (usec)   : 100=0.01%, 250=14.15%, 500=65.84%, 750=10.03%, 1000=4.83%
  lat (msec)   : 2=3.65%, 4=0.41%, 10=0.02%, 20=0.56%, 50=0.52%
  cpu          : usr=12.42%, sys=20.43%, ctx=107881, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,247296,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=370MiB/s (387MB/s), 185MiB/s-185MiB/s (194MB/s-194MB/s), io=3697MiB (3877MB), run=10005-10005msec

Disk stats (read/write):
  nvme0n1: ios=51/491922, merge=0/0, ticks=12/295684, in_queue=295697, util=99.11%