FIOLOG/nvme0n1_220601_162826_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=122257: Wed Jun  1 16:28:46 2022
  read: IOPS=704, BW=2816KiB/s (2884kB/s)(55.3MiB/20124msec)
    slat (usec): min=2, max=161, avg=17.27, stdev=10.18
    clat (usec): min=479, max=285350, avg=90865.36, stdev=36100.02
     lat (usec): min=511, max=285379, avg=90883.01, stdev=36100.20
    clat percentiles (msec):
     |  1.00th=[   12],  5.00th=[   32], 10.00th=[   45], 20.00th=[   62],
     | 30.00th=[   71], 40.00th=[   85], 50.00th=[   94], 60.00th=[  100],
     | 70.00th=[  107], 80.00th=[  118], 90.00th=[  133], 95.00th=[  148],
     | 99.00th=[  194], 99.50th=[  209], 99.90th=[  220], 99.95th=[  222],
     | 99.99th=[  279]
   bw (  KiB/s): min= 1872, max= 4151, per=25.22%, avg=2817.38, stdev=496.70, samples=40
   iops        : min=  468, max= 1037, avg=704.12, stdev=124.15, samples=40
  lat (usec)   : 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.06%, 10=0.52%, 20=1.40%, 50=11.39%
  lat (msec)   : 100=48.34%, 250=38.25%, 500=0.02%
  cpu          : usr=0.98%, sys=2.43%, ctx=8691, majf=0, minf=78
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=14168,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=122258: Wed Jun  1 16:28:46 2022
  read: IOPS=681, BW=2725KiB/s (2790kB/s)(53.6MiB/20123msec)
    slat (usec): min=2, max=119, avg=17.20, stdev=10.23
    clat (usec): min=527, max=300709, avg=93908.04, stdev=38292.81
     lat (usec): min=555, max=300749, avg=93925.62, stdev=38292.50
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   39], 10.00th=[   52], 20.00th=[   65],
     | 30.00th=[   75], 40.00th=[   87], 50.00th=[   94], 60.00th=[   99],
     | 70.00th=[  106], 80.00th=[  117], 90.00th=[  136], 95.00th=[  161],
     | 99.00th=[  218], 99.50th=[  255], 99.90th=[  292], 99.95th=[  296],
     | 99.99th=[  300]
   bw (  KiB/s): min= 1836, max= 3465, per=24.40%, avg=2726.00, stdev=359.73, samples=40
   iops        : min=  459, max=  866, avg=681.25, stdev=89.97, samples=40
  lat (usec)   : 750=0.02%
  lat (msec)   : 2=0.01%, 4=0.15%, 10=0.50%, 20=0.91%, 50=7.64%
  lat (msec)   : 100=53.69%, 250=36.29%, 500=0.79%
  cpu          : usr=1.22%, sys=2.09%, ctx=8343, majf=0, minf=80
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=13709,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=122259: Wed Jun  1 16:28:46 2022
  read: IOPS=727, BW=2911KiB/s (2981kB/s)(57.1MiB/20102msec)
    slat (usec): min=4, max=241, avg=17.22, stdev=10.26
    clat (usec): min=960, max=290943, avg=87901.68, stdev=40293.34
     lat (usec): min=995, max=290953, avg=87919.28, stdev=40293.25
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   29], 10.00th=[   42], 20.00th=[   57],
     | 30.00th=[   66], 40.00th=[   78], 50.00th=[   87], 60.00th=[   95],
     | 70.00th=[  101], 80.00th=[  116], 90.00th=[  134], 95.00th=[  157],
     | 99.00th=[  220], 99.50th=[  255], 99.90th=[  288], 99.95th=[  292],
     | 99.99th=[  292]
   bw (  KiB/s): min= 2163, max= 3992, per=26.05%, avg=2909.88, stdev=493.97, samples=40
   iops        : min=  540, max=  998, avg=727.25, stdev=123.64, samples=40
  lat (usec)   : 1000=0.01%
  lat (msec)   : 4=0.10%, 10=0.90%, 20=1.61%, 50=13.45%, 100=53.44%
  lat (msec)   : 250=29.92%, 500=0.57%
  cpu          : usr=1.17%, sys=2.44%, ctx=8993, majf=0, minf=80
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=14630,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=122260: Wed Jun  1 16:28:46 2022
  read: IOPS=681, BW=2726KiB/s (2791kB/s)(53.4MiB/20073msec)
    slat (usec): min=5, max=126, avg=17.43, stdev=10.41
    clat (msec): min=2, max=315, avg=93.88, stdev=34.88
     lat (msec): min=2, max=315, avg=93.89, stdev=34.88
    clat percentiles (msec):
     |  1.00th=[   16],  5.00th=[   39], 10.00th=[   55], 20.00th=[   67],
     | 30.00th=[   77], 40.00th=[   88], 50.00th=[   93], 60.00th=[   99],
     | 70.00th=[  107], 80.00th=[  122], 90.00th=[  134], 95.00th=[  150],
     | 99.00th=[  205], 99.50th=[  220], 99.90th=[  243], 99.95th=[  271],
     | 99.99th=[  271]
   bw (  KiB/s): min= 1884, max= 3448, per=24.35%, avg=2720.10, stdev=389.90, samples=40
   iops        : min=  471, max=  862, avg=679.78, stdev=97.52, samples=40
  lat (msec)   : 4=0.08%, 10=0.15%, 20=1.57%, 50=6.40%, 100=54.59%
  lat (msec)   : 250=37.15%, 500=0.06%
  cpu          : usr=1.16%, sys=2.21%, ctx=8404, majf=0, minf=80
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=13680,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=10.9MiB/s (11.4MB/s), 2725KiB/s-2911KiB/s (2790kB/s-2981kB/s), io=219MiB (230MB), run=20073-20124msec

Disk stats (read/write):
  nvme0n1: ios=69853/226620, merge=0/0, ticks=6357842/21689513, in_queue=28047355, util=100.00%